Repository: PiotrOsiewicz/Criterion
Catalog: po/*.po
Languages: pl

source: %1$s::%2$s: Test was skipped
pl: %1$s::%2$s: Test został pominięty

source: %1$s::%2$s: Test is disabled
pl: %1$s::%2$s: Test jest wyłączony

source: Theory %1$s::%2$s failed with the following parameters: (%3$s)
pl: Teoria %1$s::%2$s nie powiodła się z następującymi parametrami: (%3$s)

source: %1$s::%2$s: Timed out. (%3$3.2fs)
pl: %1$s::%2$s: Upłynął czas. (%3$3.2fs)

source: %1$s%2$s%3$s:%4$s%5$u%6$s: Unexpected signal caught below this line!
pl: %1$s%2$s%3$s:%4$s%5$u%6$s: Poniżej wystąpił nieoczekiwany sygnał!

source: %1$s::%2$s: CRASH!
pl: %1$s::%2$s: NIEOCZEKIWANE ZAKOŃCZENIE PROGRAMU!

source: %1$sWarning! The test `%2$s::%3$s` crashed during its setup or teardown.%4$s
pl: %1$sUwaga! Test `%2$s::%3$s` nieoczekiwanie zakończył swoje działanie podczasinicjalizacji lub dekonstrukcji.%4$s

source: %1$sWarning! The test `%2$s::%3$s` exited during its setup or teardown.%4$s
pl: %1$sUwaga! Test `%2$s::%3$s` zakończył swoje działanie podczas inicjalizacji lub dekonstrukcji.%4$s

source: Running %1$s%2$lu%3$s test from %4$s%5$s%6$s:
pl: Trwa wykonanie testu %1$s%2$lu%3$s z %4$s%5$s%6$s:

source: %1$sSynthesis: Tested: %2$s%3$lu%4$s | Passing: %5$s%6$lu%7$s | Failing: %8$s%9$lu%10$s | Crashing: %11$s%12$lu%13$s %14$s
pl: %1$sPodsumowanie: Ilość testów: %2$s%3$lu%4$s | Pomyślne: %5$s%6$lu%7$s | Nieudane: %8$s%9$lu%10$s | Nieoczekiwanie zakończone: %11$s%12$lu%13$s %14$s

source: Assertion Failed
pl: Asercja nie powiodła się

source: The conditions for this assertion were not met.
pl: Warunki dla tej asercji nie zostały spełnione.

source: The expression %s is false.
pl: Wyrażenie %s jest fałszywe.

source: %s is null.
pl: %s jest równy zero.

source: %s is not null.
pl: %s nie jest równy zero.

source: %s is empty.
pl: %s jest pusty

source: The statement `%s` did not throw any exception.
pl: Twierdzenie '%s' nie wywołało żadnego wyjątku.

source: The statement `%s` threw some exception.
pl: Twierdzenie '%s' wywołało wyjątek.

source: The expression (as strings) %1$s is false: actual=`%2$s` expected=`%3$s`.
pl: Wyrażenie (jako literały) %1$s jest fałszywe: rzeczywiste='%2$s' spodziewane='%3$s'.

source: %1$s (`%2$s`) is not empty.
pl: %1$s ('%2$s') nie jest pusty.

source: The file contents of %1$s does not match the string "%2$s".
pl: Zawartość pliku %1$s nie jest równa literałowi "%2$s".

source: The file contents of %1$s does not match the contents of %2$s.
pl: Zawartość pliku %1$s nie jest równa zawartości pliku %2$s.

source: The statement `%1$s` did throw an instance of the `%2$s` exception.
pl: Twierdzenie '%1$s' wywołało wyjątek typu '%2$s'.

source: The statement `%1$s` did not throw an instance of the `%2$s` exception.
pl: Twierdzenie '%1$s' nie wywołało wyjątku typu '%2$s'.

source: %1$sWarning! Criterion has detected that it is running under valgrind, but the number of jobs have been explicitely set. Reports might appear confusing!%2$s
pl: %1$sUwaga! Wykryto działanie pod Valgrindem,jednak ilość prac została jawnie ustawiona. Raporty mogą być mylące!%2$s

source: Could not open the file @ `%1$s` for %2$s reporting: %3$s.
pl: Nie udało się otworzyć pliku @ `%1$s` do %2$s raportowania: %3$s.

source: Writing %1$s report in `%2$s`.
pl: Zapisywanie raportu %1$s w `%2$s`.
